; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))

(:functions (total-cost))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
               (increase (total-cost) 5))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
               (increase (total-cost) 2))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
(increase (total-cost) 2))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 3))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
	       (increase (total-cost) 1))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

)

; problem
(define (problem name)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 
           tile_1-1 tile_1-2 
           tile_2-1 tile_2-2 
           tile_3-1 tile_3-2 
           tile_4-1 tile_4-2 
           tile_5-1 tile_5-2 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 
   (= (total-cost) 0)
   (robot-at robot1 tile_4-1)
   (robot-has robot1 white)
   (robot-at robot2 tile_5-2)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-2)
   (clear tile_1-1)
   (clear tile_1-2)
   (clear tile_2-1)
   (clear tile_2-2)
   (clear tile_3-1)
   (clear tile_3-2)
   (clear tile_4-2)
   (clear tile_5-1)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_4-1 tile_3-1)
   (up tile_4-2 tile_3-2)
   (up tile_5-1 tile_4-1)
   (up tile_5-2 tile_4-2)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_3-1 tile_4-1)
   (down tile_3-2 tile_4-2)
   (down tile_4-1 tile_5-1)
   (down tile_4-2 tile_5-2)
   (right tile_0-2 tile_0-1)
   (right tile_1-2 tile_1-1)
   (right tile_2-2 tile_2-1)
   (right tile_3-2 tile_3-1)
   (right tile_4-2 tile_4-1)
   (right tile_5-2 tile_5-1)
   (left tile_0-1 tile_0-2)
   (left tile_1-1 tile_1-2)
   (left tile_2-1 tile_2-2)
   (left tile_3-1 tile_3-2)
   (left tile_4-1 tile_4-2)
   (left tile_5-1 tile_5-2)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_5-1 white)
    (painted tile_5-2 black)
))
 (:metric minimize (total-cost))
)

; plan
1. (down robot2 tile_5-2 tile_4-2)
   deleted: (robot-at robot2 tile_5-2) (clear tile_4-2)
   added: (robot-at robot2 tile_4-2) (clear tile_5-2)
   goals met: 0 of 10
2. (paint-up robot2 tile_5-2 tile_4-2 black)
   deleted: (clear tile_5-2)
   added: (painted tile_5-2 black)
   goals met: 1 of 10
3. (paint-up robot1 tile_5-1 tile_4-1 white)
   deleted: (clear tile_5-1)
   added: (painted tile_5-1 white)
   goals met: 2 of 10
4. (down robot1 tile_4-1 tile_3-1)
   deleted: (robot-at robot1 tile_4-1) (clear tile_3-1)
   added: (robot-at robot1 tile_3-1) (clear tile_4-1)
   goals met: 2 of 10
5. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 2 of 10
6. (paint-up robot1 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 3 of 10
7. (down robot1 tile_3-1 tile_2-1)
   deleted: (robot-at robot1 tile_3-1) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_3-1)
   goals met: 3 of 10
8. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 3 of 10
9. (paint-up robot1 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 4 of 10
10. (down robot1 tile_2-1 tile_1-1)
   deleted: (robot-at robot1 tile_2-1) (clear tile_1-1)
   added: (robot-at robot1 tile_1-1) (clear tile_2-1)
   goals met: 4 of 10
11. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 4 of 10
12. (paint-up robot1 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 5 of 10
13. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 5 of 10
14. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 5 of 10
15. (down robot1 tile_1-1 tile_0-1)
   deleted: (robot-at robot1 tile_1-1) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_1-1)
   goals met: 5 of 10
16. (down robot2 tile_4-2 tile_3-2)
   deleted: (robot-at robot2 tile_4-2) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_4-2)
   goals met: 5 of 10
17. (paint-up robot1 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 6 of 10
18. (paint-up robot2 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 7 of 10
19. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 7 of 10
20. (down robot2 tile_3-2 tile_2-2)
   deleted: (robot-at robot2 tile_3-2) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_3-2)
   goals met: 7 of 10
21. (paint-up robot2 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 8 of 10
22. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 8 of 10
23. (down robot2 tile_2-2 tile_1-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_1-2)
   added: (robot-at robot2 tile_1-2) (clear tile_2-2)
   goals met: 8 of 10
24. (paint-up robot2 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 9 of 10
25. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 9 of 10
26. (down robot2 tile_1-2 tile_0-2)
   deleted: (robot-at robot2 tile_1-2) (clear tile_0-2)
   added: (robot-at robot2 tile_0-2) (clear tile_1-2)
   goals met: 9 of 10
27. (paint-up robot2 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 10 of 10
